Repository: xcv58/MacTools
Catalog: Plugins/ZshConfig/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# snippet.export.description
source: 设置或覆盖环境变量
ar: اضبط متغير بيئة أو تجاوزه
de: Umgebungsvariable festlegen oder überschreiben
en: Set or override an environment variable
es: Define o reemplaza una variable de entorno
fr: Définir ou remplacer une variable d’environnement
ja: 環境変数を設定または上書き
ko: 환경 변수 설정 또는 덮어쓰기
pt: Defina ou substitua uma variável de ambiente
ru: Задать или переопределить переменную среды
tr: Bir ortam değişkeni ayarlar veya üzerine yazar
zh_hant: 設定或覆寫環境變數

# snippet.export.placeholder
source: 变量名=值，例：EDITOR=nvim
ar: name=value، مثال: EDITOR=nvim
de: Name=Wert, z. B. EDITOR=nvim
en: name=value, e.g. EDITOR=nvim
es: nombre=valor, p. ej. EDITOR=nvim
fr: nom=valeur, ex. EDITOR=nvim
ja: 名前=値、例：EDITOR=nvim
ko: 이름=값, 예: EDITOR=nvim
pt: nome=valor, ex. EDITOR=nvim
ru: имя=значение, напр. EDITOR=nvim
tr: ad=değer, örn. EDITOR=nvim
zh_hant: 變數名=值，例：EDITOR=nvim

# snippet.export.title
source: 环境变量
ar: متغير بيئة
de: Umgebungsvariable
en: Environment Variable
es: Variable de entorno
fr: Variable d’environnement
ja: 環境変数
ko: 환경 변수
pt: Variável de ambiente
ru: Переменная среды
tr: Ortam Değişkeni
zh_hant: 環境變數

# snippet.function.bodyComment
source: 在此填写函数内容
ar: أضف جسم الدالة هنا
de: Funktionskörper hier einfügen
en: Add function body here
es: Añade aquí el cuerpo de la función
fr: Ajoutez ici le corps de la fonction
ja: ここに関数本体を追加
ko: 여기에 함수 본문 추가
pt: Adicione o corpo da função aqui
ru: Добавьте тело функции здесь
tr: İşlev gövdesini buraya ekleyin
zh_hant: 在此填寫函式內容

# snippet.function.description
source: 定义一个可复用的 Shell 函数
ar: عرّف دالة shell قابلة لإعادة الاستخدام
de: Wiederverwendbare Shell-Funktion definieren
en: Define a reusable shell function
es: Define una función de shell reutilizable
fr: Définissez une fonction shell réutilisable
ja: 再利用できるシェル関数を定義
ko: 재사용 가능한 셸 함수 정의
pt: Defina uma função shell reutilizável
ru: Определить повторно используемую функцию shell
tr: Yeniden kullanılabilir bir Shell işlevi tanımlar
zh_hant: 定義可重複使用的 shell 函式

# snippet.function.placeholder
source: 函数名称，例：mkcd
ar: اسم الدالة، مثال: mkcd
de: Funktionsname, z. B. mkcd
en: function name, e.g. mkcd
es: nombre de función, p. ej. mkcd
fr: nom de fonction, ex. mkcd
ja: 関数名、例：mkcd
ko: 함수 이름, 예: mkcd
pt: nome da função, ex. mkcd
ru: имя функции, напр. mkcd
tr: işlev adı, örn. mkcd
zh_hant: 函式名稱，例：mkcd

# snippet.function.title
source: 函数
ar: دالة
de: Funktion
en: Function
es: Función
fr: Fonction
ja: 関数
ko: 함수
pt: Função
ru: Функция
tr: İşlev
zh_hant: 函式

# snippet.path.description
source: 将目录追加到 $PATH
ar: أضف دليلاً إلى $PATH
de: Verzeichnis an $PATH anhängen
en: Append a directory to $PATH
es: Añade un directorio a $PATH
fr: Ajoutez un dossier à $PATH
ja: $PATH にディレクトリを追加
ko: $PATH에 디렉터리 추가
pt: Adicione um diretório ao $PATH
ru: Добавить каталог в $PATH
tr: Bir dizini $PATH sonuna ekler
zh_hant: 將目錄附加到 $PATH

# snippet.path.placeholder
source: 目录路径，例：/opt/homebrew/bin
ar: مسار الدليل، مثال: /opt/homebrew/bin
de: Verzeichnispfad, z. B. /opt/homebrew/bin
en: directory path, e.g. /opt/homebrew/bin
es: ruta del directorio, p. ej. /opt/homebrew/bin
fr: chemin du dossier, ex. /opt/homebrew/bin
ja: ディレクトリパス、例：/opt/homebrew/bin
ko: 디렉터리 경로, 예: /opt/homebrew/bin
pt: caminho do diretório, ex. /opt/homebrew/bin
ru: путь к каталогу, напр. /opt/homebrew/bin
tr: dizin yolu, örn. /opt/homebrew/bin
zh_hant: 目錄路徑，例：/opt/homebrew/bin

# snippet.path.title
source: PATH 路径
ar: دليل PATH
de: PATH-Verzeichnis
en: PATH Directory
es: Directorio PATH
fr: Dossier PATH
ja: PATH ディレクトリ
ko: PATH 디렉터리
pt: Diretório PATH
ru: Каталог PATH
tr: PATH Dizini
zh_hant: PATH 路徑

# snippet.source.description
source: 在当前 Shell 中执行另一个脚本
ar: شغّل سكربتاً آخر في shell الحالي
de: Weiteres Skript in der aktuellen Shell ausführen
en: Run another script in the current shell
es: Ejecuta otro script en el shell actual
fr: Exécutez un autre script dans le shell actuel
ja: 現在のシェルで別のスクリプトを実行
ko: 현재 셸에서 다른 스크립트 실행
pt: Execute outro script no shell atual
ru: Запустить другой скрипт в текущей оболочке
tr: Başka bir betiği geçerli Shell'de çalıştırır
zh_hant: 在目前 shell 中執行另一個腳本

# snippet.source.placeholder
source: 文件路径，例：~/.config/secrets.sh
ar: مسار الملف، مثال: ~/.config/secrets.sh
de: Dateipfad, z. B. ~/.config/secrets.sh
en: file path, e.g. ~/.config/secrets.sh
es: ruta del archivo, p. ej. ~/.config/secrets.sh
fr: chemin du fichier, ex. ~/.config/secrets.sh
ja: ファイルパス、例：~/.config/secrets.sh
ko: 파일 경로, 예: ~/.config/secrets.sh
pt: caminho do arquivo, ex. ~/.config/secrets.sh
ru: путь к файлу, напр. ~/.config/secrets.sh
tr: dosya yolu, örn. ~/.config/secrets.sh
zh_hant: 檔案路徑，例：~/.config/secrets.sh

# snippet.source.title
source: 加载文件
ar: تحميل ملف
de: Datei sourcen
en: Source File
es: Cargar archivo
fr: Charger un fichier
ja: ファイルを source
ko: 파일 source
pt: Carregar arquivo
ru: Загрузить файл
tr: Dosya Yükle
zh_hant: 載入檔案

# store.error.createFailed
source: 创建失败：%@
ar: فشل الإنشاء: %@
de: Erstellen fehlgeschlagen: %@
en: Create failed: %@
es: Error al crear: %@
fr: Échec de la création : %@
ja: 作成に失敗しました: %@
ko: 생성 실패: %@
pt: Falha na criação: %@
ru: Не удалось создать: %@
tr: Oluşturulamadı: %@
zh_hant: 創建失敗：%@

# store.error.readFailed
source: 读取失败：%@
ar: فشلت القراءة: %@
de: Lesen fehlgeschlagen: %@
en: Read failed: %@
es: Error de lectura: %@
fr: Échec de lecture : %@
ja: 読み取りに失敗しました: %@
ko: 읽기 실패: %@
pt: Falha na leitura: %@
ru: Ошибка чтения: %@
tr: Okunamadı: %@
zh_hant: 讀取失敗：%@

# store.error.saveFailed
source: 保存失败：%@
ar: فشل الحفظ: %@
de: Speichern fehlgeschlagen: %@
en: Save failed: %@
es: Error al guardar: %@
fr: Échec de l'enregistrement : %@
ja: 保存に失敗しました: %@
ko: 저장 실패: %@
pt: Falha ao salvar: %@
ru: Не удалось сохранить: %@
tr: Kaydedilemedi: %@
zh_hant: 保存失敗：%@

# store.header.createdAt
source: 由 MacTools 创建于 %@
ar: تم إنشاؤه بواسطة MacTools في %@
de: Von MacTools erstellt am %@
en: Created by MacTools at %@
es: Creado por MacTools el %@
fr: Créé par MacTools le %@
ja: MacTools が %@ に作成
ko: MacTools에서 %@에 생성
pt: Criado pelo MacTools em %@
ru: Создано MacTools: %@
tr: MacTools tarafından %@ tarihinde oluşturuldu
zh_hant: 由 MacTools 建立於 %@

# store.header.recommendedUse
source: 推荐用途：%@
ar: الاستخدام الموصى به: %@
de: Empfohlene Verwendung: %@
en: Recommended use: %@
es: Uso recomendado: %@
fr: Usage conseillé : %@
ja: 推奨用途：%@
ko: 권장 용도: %@
pt: Uso recomendado: %@
ru: Рекомендуется для: %@
tr: Önerilen kullanım: %@
zh_hant: 建議用途：%@

# store.header.reloadHint
source: 保存后，在终端执行 %@ 即可立即生效（仅 .zshrc）。
ar: بعد الحفظ، شغّل %@ في Terminal لتطبيق التغييرات فوراً (.zshrc فقط).
de: Nach dem Speichern %@ in Terminal ausführen, um Änderungen sofort zu übernehmen (nur .zshrc).
en: After saving, run %@ in Terminal to apply changes immediately (.zshrc only).
es: Después de guardar, ejecuta %@ en Terminal para aplicar los cambios de inmediato (solo .zshrc).
fr: Après l’enregistrement, exécutez %@ dans Terminal pour appliquer immédiatement les changements (.zshrc uniquement).
ja: 保存後、ターミナルで %@ を実行するとすぐに反映されます（.zshrc のみ）。
ko: 저장 후 터미널에서 %@을(를) 실행하면 변경 사항이 즉시 적용됩니다(.zshrc만).
pt: Depois de salvar, execute %@ no Terminal para aplicar as alterações imediatamente (somente .zshrc).
ru: После сохранения выполните %@ в Terminal, чтобы сразу применить изменения (только .zshrc).
tr: Kaydettikten sonra değişikliklerin hemen uygulanması için %@ komutunu Terminal'de çalıştırın (yalnızca .zshrc).
zh_hant: 儲存後，在終端機執行 %@ 即可立即生效（僅 .zshrc）。

# store.header.role
source: 说明：%@
ar: الوصف: %@
de: Beschreibung: %@
en: Description: %@
es: Descripción: %@
fr: Description : %@
ja: 説明：%@
ko: 설명: %@
pt: Descrição: %@
ru: Описание: %@
tr: Açıklama: %@
zh_hant: 說明：%@

# store.header.whenLoaded
source: 加载时机：%@
ar: التحميل: %@
de: Geladen: %@
en: Loaded: %@
es: Carga: %@
fr: Chargement : %@
ja: 読み込み：%@
ko: 로드: %@
pt: Carrega: %@
ru: Загрузка: %@
tr: Yükleme zamanı: %@
zh_hant: 載入時機：%@

# permission.automation.description
source: 从终端载入配置时需要控制“终端”。
ar: يتطلب تحميل الإعدادات من الوحدة الطرفية التحكم في تطبيق الوحدة الطرفية.
de: Zum Laden der Konfiguration aus Terminal muss Terminal gesteuert werden.
en: Loading configuration from Terminal requires controlling Terminal.
es: Cargar la configuración desde Terminal requiere controlar Terminal.
fr: Charger la configuration depuis Terminal nécessite de contrôler Terminal.
ja: ターミナルから設定を読み込むには、ターミナルの制御が必要です。
ko: 터미널에서 구성을 불러오려면 터미널을 제어해야 합니다.
pt: Carregar a configuração pelo Terminal requer o controle do Terminal.
ru: Для загрузки конфигурации из Терминала требуется управление Терминалом.
tr: Yapılandırmayı Terminal'den yüklemek, Terminal'i denetlemeyi gerektirir.
zh_hant: 從「終端機」載入設定時需要控制「終端機」。

# permission.automation.footnote
source: macOS 会在首次从终端载入配置时请求自动化授权。
ar: سيطلب macOS إذن الأتمتة عند تحميل الإعدادات من الوحدة الطرفية للمرة الأولى.
de: macOS fragt beim ersten Laden der Konfiguration aus Terminal nach der Automation-Berechtigung.
en: macOS will request Automation access the first time configuration is loaded from Terminal.
es: macOS solicitará acceso de automatización la primera vez que se cargue la configuración desde Terminal.
fr: macOS demandera l’autorisation d’automatisation lors du premier chargement de la configuration depuis Terminal.
ja: ターミナルから初めて設定を読み込むときに、macOSがオートメーションの許可を求めます。
ko: 터미널에서 구성을 처음 불러올 때 macOS가 자동화 권한을 요청합니다.
pt: O macOS solicitará acesso à Automação na primeira vez que a configuração for carregada pelo Terminal.
ru: При первой загрузке конфигурации из Терминала macOS запросит доступ к автоматизации.
tr: macOS, yapılandırma Terminal'den ilk kez yüklendiğinde Otomasyon erişimi isteyecek.
zh_hant: macOS 會在首次從「終端機」載入設定時要求自動化授權。

# permission.automation.title
source: 自动化
ar: الأتمتة
de: Automation
en: Automation
es: Automatización
fr: Automatisation
ja: オートメーション
ko: 자동화
pt: Automação
ru: Автоматизация
tr: Otomasyon
zh_hant: 自動化

# permission.automation.status
source: 按需确认
ar: تأكيد عند الاستخدام
de: Bestätigung bei Verwendung
en: Confirm on Use
es: Confirmar al usar
fr: Confirmation à l’utilisation
ja: 使用時に確認
ko: 사용 시 확인
pt: Confirmar ao usar
ru: Подтверждение при использовании
tr: Kullanımda Onaylanır
zh_hant: 按需確認
